tutorials/incompressible/pimpleFoam/LES/channel395DFSEM/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         85;

deltaT          4e-3;

writeControl    timeStep;

writeInterval   25;

purgeWrite      10;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    Q1
    {
        type            Q;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
    }
    vorticity1
    {
        type            vorticity;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
    }
    yPlus
    {
        type            yPlus;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
    }
    lambVector1                                                                 
    {                                                                           
        type            lambVector;                                                 
        libs            ("libfieldFunctionObjects.so");                             
        writeControl    writeTime;                                              
        field           U;                                                          
    }                                                                           
    div1                                                                        
    {                                                                           
        type            div;                                                        
        libs            ("libfieldFunctionObjects.so");                             
        writeControl    writeTime;                                              
        field           lambVector;                                                 
    }
    fieldAverage1
    {
        type            fieldAverage;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
        timeStart       8.5;

        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            lambVector                                                          
            {                                                                   
                mean        on;                                                 
                prime2Mean  off;                                                
                base        time;                                               
            }                                                                                                                                      

            div(lambVector)                                                     
            {                                                                   
                mean        on;                                                 
                prime2Mean  off;                                                
                base        time;                                               
            }
        );
    }
}


// ************************************************************************* //
